#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

OpenTofu
module.networks["dev_au"].data.konnect_cloud_gateway_provider_account_list.my_cloudgatewayprovideraccountlist: Reading...
module.control-planes.konnect_gateway_control_plane.cps["dev_au_cloud"]: Refreshing state... [id=184ae20e-28b5-418b-8d93-e0c78dc7a5b6]
module.networks["dev_au"].data.konnect_cloud_gateway_provider_account_list.my_cloudgatewayprovideraccountlist: Read complete after 0s
module.networks["dev_au"].konnect_cloud_gateway_network.cgw_network: Refreshing state... [id=cd5b2a72-7ef8-4a50-8db1-589ff1cf46e4]
module.kong-configs-dev-au-cloud.konnect_gateway_consumer.users["bob"]: Refreshing state... [id=d68ea6ab-2152-418a-bd34-9a584f13a938]
module.kong-configs-dev-au-cloud.konnect_gateway_consumer.users["joe"]: Refreshing state... [id=ac0101ee-015a-404e-bad0-75799694e940]
module.kong-configs-dev-au-cloud.konnect_gateway_consumer.users["anna"]: Refreshing state... [id=e366247e-fb6c-421a-9334-b99ae48d9b5a]
module.kong-configs-dev-au-cloud.konnect_gateway_consumer.users["tom"]: Refreshing state... [id=12175881-32be-4b90-8477-77efa51734f7]
module.kong-configs-dev-au-cloud.konnect_gateway_consumer.users["robin"]: Refreshing state... [id=57cc57f6-7902-4ff9-a10f-d8841fd0e385]
module.kong-configs-dev-au-cloud.konnect_gateway_consumer.users["gary"]: Refreshing state... [id=9923ea3f-770b-4835-9ee3-fd6d35e5edf5]
module.kong-configs-dev-au-cloud.konnect_gateway_consumer.users["alex"]: Refreshing state... [id=7ff0afff-423a-4446-adbd-195d098f7371]
module.kong-configs-dev-au-cloud.konnect_gateway_consumer.users["alice"]: Refreshing state... [id=85d3366f-b017-4a99-baaa-dfc006704d80]
module.kong-configs-dev-au-cloud.konnect_gateway_route.catch_all: Refreshing state... [id=324d3c74-61bf-4788-af88-b97a0961e1f6]
module.kong-configs-dev-au-cloud.konnect_gateway_service.httpbin: Refreshing state... [id=7d78bdc8-5668-4892-849d-097e841ac551]
module.kong-configs-dev-au-cloud.konnect_gateway_plugin_key_auth.key_auth: Refreshing state... [id=a54633de-28c4-4030-9526-e89913d4e028]
module.kong-configs-dev-au-cloud.konnect_gateway_service.echo: Refreshing state... [id=02919904-7d95-4e72-8a00-d43d63d69262]
module.cloud-gateways["dev_au"].konnect_cloud_gateway_custom_domain.cgw_custom_domain: Refreshing state... [id=9af59e46-e9aa-4418-96ea-614e87a286ee]
module.cloud-gateways["dev_au"].konnect_cloud_gateway_configuration.cgw_dp: Refreshing state... [id=fe74419b-9592-436a-9e22-750ec06bfe97]
module.kong-configs-dev-au-cloud.konnect_gateway_route.httpbin: Refreshing state... [id=ca1b5113-aecf-4278-9e9e-8d30108ed14d]
module.kong-configs-dev-au-cloud.konnect_gateway_key_auth.user_apikeys["tom"]: Refreshing state... [id=a318ae4d-e2cd-4239-8a99-c783c3985ea1]
module.kong-configs-dev-au-cloud.konnect_gateway_key_auth.user_apikeys["alice"]: Refreshing state... [id=26661406-922b-49ec-ba0f-f477df16d28f]
module.kong-configs-dev-au-cloud.konnect_gateway_key_auth.user_apikeys["gary"]: Refreshing state... [id=68266b74-d2be-41a5-9870-6adff0f9832c]
module.kong-configs-dev-au-cloud.konnect_gateway_key_auth.user_apikeys["anna"]: Refreshing state... [id=de8a0d04-d3cf-4941-92d5-c85b7f5fb179]
module.kong-configs-dev-au-cloud.konnect_gateway_key_auth.user_apikeys["bob"]: Refreshing state... [id=2bd70a11-7e8a-40ec-a7a5-5cb94dd1e060]
module.kong-configs-dev-au-cloud.konnect_gateway_key_auth.user_apikeys["robin"]: Refreshing state... [id=815d2603-cadb-4aea-a392-c9c249a06da9]
module.kong-configs-dev-au-cloud.konnect_gateway_key_auth.user_apikeys["alex"]: Refreshing state... [id=3ef22ffe-73eb-46d7-b90d-d86231d29555]
module.kong-configs-dev-au-cloud.konnect_gateway_key_auth.user_apikeys["joe"]: Refreshing state... [id=776c4b02-7e64-4cfc-a570-ee5fa46d0a66]
module.kong-configs-dev-au-cloud.konnect_gateway_plugin_request_termination.catch_all_terminate: Refreshing state... [id=bc95f224-ef33-4f9e-b572-8b7d4a6b9b9f]
module.kong-configs-dev-au-cloud.konnect_gateway_route.echo: Refreshing state... [id=b82ed0ae-8d2e-45b8-b3f5-de90548cf68b]

Note: Objects have changed outside of OpenTofu

OpenTofu detected the following changes made outside of OpenTofu since the
last "tofu apply" which may have affected this plan:

  # module.cloud-gateways["dev_au"].konnect_cloud_gateway_configuration.cgw_dp has changed
  ~ resource "konnect_cloud_gateway_configuration" "cgw_dp" {
      ~ dataplane_groups       = [
          ~ {
              + state                    = "ready"
                # (4 unchanged attributes hidden)
            },
        ]
        id                     = "fe74419b-9592-436a-9e22-750ec06bfe97"
        # (8 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

OpenTofu used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place

OpenTofu will perform the following actions:

  # module.cloud-gateways["dev_au"].konnect_cloud_gateway_configuration.cgw_dp will be updated in-place
  ~ resource "konnect_cloud_gateway_configuration" "cgw_dp" {
      ~ created_at             = "2024-08-14T15:42:00.511Z" -> (known after apply)
      ~ dataplane_group_config = [
          - {
              - autoscale                = {
                  - configuration_data_plane_group_autoscale_static = {
                      - instance_type       = "small" -> null
                      - kind                = "static" -> null
                      - requested_instances = 1 -> null
                    } -> null
                } -> null
              - cloud_gateway_network_id = "cd5b2a72-7ef8-4a50-8db1-589ff1cf46e4" -> null
              - provider                 = "aws" -> null
              - region                   = "ap-southeast-2" -> null
            },
        ] -> (known after apply)
      ~ dataplane_groups       = [
          ~ {
              ~ autoscale                = {
                  + configuration_data_plane_group_autoscale_autopilot = (known after apply)
                  ~ configuration_data_plane_group_autoscale_static    = {
                      ~ instance_type       = "small" -> "medium"
                        # (2 unchanged attributes hidden)
                    }
                }
              ~ created_at               = "2024-08-14T15:42:00.511Z" -> (known after apply)
              ~ egress_ip_addresses      = [
                  - "54.153.180.176",
                  - "13.54.214.4",
                  - "54.206.225.242",
                ] -> (known after apply)
              ~ id                       = "eaf233cc-4408-4398-b6f9-e0a1d37a9871" -> (known after apply)
              ~ private_ip_addresses     = [] -> (known after apply)
              ~ state                    = "ready" -> (known after apply)
              ~ updated_at               = "2024-08-14T15:47:07.297Z" -> (known after apply)
                # (3 unchanged attributes hidden)
            },
        ]
      ~ entity_version         = 1 -> (known after apply)
      ~ id                     = "fe74419b-9592-436a-9e22-750ec06bfe97" -> (known after apply)
      ~ updated_at             = "2024-08-14T15:42:00.511Z" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

Plan: 0 to add, 1 to change, 0 to destroy.

Changes to Outputs:
  ~ cloud_gateway_edge_urls = {
      ~ dev_au = {
          + status          = (known after apply)
            # (2 unchanged attributes hidden)
        }
    }

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so OpenTofu can't
guarantee to take exactly these actions if you run "tofu apply" now.

```

</details>

*Pusher: @liyangau, Action: `pull_request`*